src/Catalogs/ЖИПК_КлючиАналитикиПрикладныхРешений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЖИПК_КлючиАналитикиПрикладныхРешений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отсутствует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрикладногоРешения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЖИПК_ТипыПрикладныхРешений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ЖИПК_АнализПрикладныхРешенийСлужебный/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьНовыйКлючАналитики(СтруктураДобавления) Экспорт
                        	
	ДобКлюч = Справочники.ЖИПК_КлючиАналитикиПрикладныхРешений.СоздатьЭлемент();
	ДобКлюч.Наименование = СтруктураДобавления.Наименование;
	ДобКлюч.ИдентификаторРешения = СтруктураДобавления.ИдентификаторРешения;
	ДобКлюч.Отсутствует = СтруктураДобавления.Отсутствует;
	ДобКлюч.ТипПрикладногоРешения = СтруктураДобавления.ТипПрикладногоРешения;
	
	Попытка
		ДобКлюч.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура ПометитьОтсутствиеРешения(КлючАналитики) Экспорт

	Если ТипЗнч(КлючАналитики) <> Тип("СправочникСсылка.ЖИПК_КлючиАналитикиПрикладныхРешений") Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОбъект = КлючАналитики.ПолучитьОбъект();
	ЭлементОбъект.Отсутствует = Истина;
	
	Попытка
		ЭлементОбъект.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура СнятьОтметкуОтсутствияРешения(КлючАналитики) Экспорт

	Если ТипЗнч(КлючАналитики) <> Тип("СправочникСсылка.ЖИПК_КлючиАналитикиПрикладныхРешений") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не КлючАналитики.Отсутствует Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОбъект = КлючАналитики.ПолучитьОбъект();
	ЭлементОбъект.Отсутствует = Ложь;
	
	Попытка
		ЭлементОбъект.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
